Ran Plan for 2 projects:

1. dir: `Backend` workspace: `default`
1. dir: `Infrastructure` workspace: `default`
---

### 1. dir: `Backend` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.sa_key_json will be created
+ resource "local_file" "sa_key_json" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../Infrastructure/key.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d Backend
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://158.160.171.130/atlantis/lock?id=RuslanArestov%252FProjectFinalWork%252FBackend%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d Backend
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `Infrastructure` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/atlantis-data/repos/RuslanArestov/ProjectFinalWork/2/default/Infrastructure/default.tfplan"' in '/atlantis-data/repos/RuslanArestov/ProjectFinalWork/2/default/Infrastructure': exit status 1
data.terraform_remote_state.backend: Reading...
data.terraform_remote_state.backend: Read complete after 0s
data.yandex_compute_image.ubuntu: Reading...
yandex_vpc_network.k8s-network: Refreshing state... [id=enp6f7731u9vlhjpo7hj]
yandex_alb_http_router.k8s_router: Refreshing state... [id=ds7mt26btrl9mfffm6r9]
yandex_container_registry.nginx-app: Refreshing state... [id=crpjn9i18sh1h62a9tc7]
yandex_function.test-function: Refreshing state... [id=d4ef3k8dv5fsqal7j1ee]
data.yandex_compute_image.ubuntu: Read complete after 0s [id=fd8j1v2gspupk43encvq]
yandex_vpc_subnet.bastion-subnet: Refreshing state... [id=e9b33pv55i27lainukcr]
yandex_vpc_security_group.alb_sg: Refreshing state... [id=enpnikvv1mumfr6g1ig9]
yandex_vpc_security_group.k8s_sg: Refreshing state... [id=enpaktmo1crsgfbik1l6]
yandex_vpc_subnet.k8s-subnet-d: Refreshing state... [id=fl843b57fjfdqpnh4nu6]
yandex_function_trigger.my-trigger: Refreshing state... [id=a1s27e612o94pgfok96u]
null_resource.docker_build_and_push: Refreshing state... [id=1423454122908859196]

Changes to Outputs:
  ~ ssh_private_key_path = "~/.ssh/k8s_key" -> "/secrets/ssh/k8s_key_ed25519"

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.
╷
│ Error: Invalid function argument
│ 
│   on main.tf line 355, in data "template_file" "userdata":
│  355:     ssh_public_key = file(var.ssh_public_key)
│     ├────────────────
│     │ while calling file(path)
│     │ var.ssh_public_key is "/secrets/ssh/k8s_key_ed25519.pub"
│ 
│ Invalid value for "path" parameter: no file exists at
│ "/secrets/ssh/k8s_key_ed25519.pub"; this function works only with files
│ that are distributed as part of the configuration source code, so if this
│ file will be created by a resource in this configuration you must instead
│ obtain this result from an attribute of that resource.
╵
╷
│ Error: Invalid function argument
│ 
│   on main.tf line 363, in data "template_file" "userdata_bastion":
│  363:     ssh_public_key = file(var.ssh_public_key)
│     ├────────────────
│     │ while calling file(path)
│     │ var.ssh_public_key is "/secrets/ssh/k8s_key_ed25519.pub"
│ 
│ Invalid value for "path" parameter: no file exists at
│ "/secrets/ssh/k8s_key_ed25519.pub"; this function works only with files
│ that are distributed as part of the configuration source code, so if this
│ file will be created by a resource in this configuration you must instead
│ obtain this result from an attribute of that resource.
╵

```
</details>

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```